export default function blogPosts() {
    return [
        {
            id: 1,
             name: "Створення компанії",
            date: new Date("2020-10-01"),
            info: "Створення компанії для розробки комп'ютерних ігор.",
            imgUrl: "./assets/Logo.jpg"
        },
        {
            id: 2,
            name: "Набір розробників",
            date: new Date("2020-10-02"),
            info: "Набір в команду: В нас з'явився головний розробник та головний дизайнер.",
            imgUrl: "./assets/Logo.jpg"
        },
        {
            id: 3,
            name: "Початок роботи",
            date: new Date("2021-01-15"),
            info: "Початок роботи. ",
            imgUrl: "./assets/Logo.jpg"
        },
        {
            id: 4,
            name: "Перший проект",
            date: new Date("2021-01-16"),
            info: "В пошуках ідей для першого проекту для нашої компанії.",
            imgUrl: "./assets/Logo.jpg"
        },
        {
            id: 5,
            name: "Концепція нового проекту/гри",
            date: new Date("2021-01-16"),
            info: "Концепція гри брала натхнення з гри серії Tom Clancy's the Division. Також концепти вигляду гри брались з фантазії головного дизайнера.",
            imgUrl: "./assets/Logo.jpg"
        },
        {
            id: 6,
            name: "Вибір жанру та стилів",
            date: new Date("2021-01-17"),
            info: "Перший проект позоціонує себе як 2D гра в жанрі шутер, в стилі top-duwn. Буде розроблятись на ігровому рушії Unity.",
            imgUrl: "./assets/Logo.jpg",
        },
        {
            id: 7,
            name: "Ознайомлення з Unity",
            date: new Date("2021-02-25"),
            info: "Оскільки в нас немає досіду з роботою в Unity - ми почали дивитись курси та уроки по ньому щоб зрозуміти з чим ми маємо справу.",
            imgUrl: "./assets/Logo.jpg"
        },
        {
            id: 8,
            name: "Набуття нових вмінь в Visual Studio на C#",
            date: new Date("2020-02-30"),
            info: "Вивчення нових систем та бібліотек, нових фішок, та поеднання розробки з Unity.",
            imgUrl: "./assets/Logo.jpg"
        },
        {
            id: 9,
            name: "Тест набутих навичок в Unity",
            date: new Date("2021-03-07"),
            info: "Проведення простих тестів",
            imgUrl: "./assets/Logo.jpg"
        },
        {
            id: 10,
            name: "Створення простого коду гри",
            date: new Date("2021-03-10"),
            info: "Створення простих скриптів головного персонажу пересування та стрільби.",
            imgUrl: "./assets/Logo.jpg"
        },
        {
            id: 11,
            name: "Набуття навичок для створення графічних елемнів гри",
            date: new Date("2021-04-24"),
            info: "Вивчення нових графічних методів для створення спрайтів персонажів.",
            imgUrl: "./assets/Logo.jpg"
        },
        {
            id: 12,
            name: "Створення перших спрайтів головного героя",
            date: new Date("2021-04-24"),
            info: "Створення спрайтів та редагування їх маштабу.",
            imgUrl: "./assets/Logo.jpg"
        },
        {
            id: 13,
            name: "Робота з першою анімацією",
            date: new Date("2021-06-03"),
            info: "Набуття навичок з аніматором в Unity та створення анімацій головного героя.",
            imgUrl: "./assets/Logo.jpg"
        },
        {
            id: 14,
            name: "Вдосконалення спрайтів",
            date: new Date("2021-09-15"),
            info: "Переробка спрайтів на більш кращий вигляд.",
            imgUrl: "./assets/Logo.jpg"
        },
        {
            id: 15,
            name: "Переробка коду",
            date: new Date("2021-09-20"),
            info: "Оптимізація та додавання нових функцій, переробка коду перекладаючи деякі процеси на ігровий рушій.",
            imgUrl: "./assets/Logo.jpg"
        },
        {
            id: 16,
            name: "Створення спрайтів ворогів",
            date: new Date("2021-09-26"),
            info: "Продумання та розробка ворогів та їх головних спрайтів та спрайтів анімації.",
            imgUrl: "./assets/Logo.jpg"
        },
        {
            id: 17,
            name: "Набуття навичок з розробки штучного інтелекту для Unity на C#",
            date: new Date("2021-10-08"),
            info: "Вивчення по онлайн урокам методи створення штучного інтелекту для Unity на C#.",
            imgUrl: "./assets/Logo.jpg"
        },
        {
            id: 18,
            name: "Розробка коду першого штучного інтелекту",
            date: new Date("2021-10-08"),
            info: "Розробка штучного інтелекту для ворогів, їх пересування та стрільб.",
            imgUrl: "./assets/Logo.jpg"
        },
        {
            id: 19,
            name: "Набуття навичок з оформелнням старту гри",
            date: new Date("2021-11-12"),
            info: "Вивчення та ствоерння початку гри та перші альфа-версії гри.",
            imgUrl: "./assets/Logo.jpg"
        },
        {
            id: 20,
            name: "Вибір ігрових механік",
            date: new Date("2021-11-21"),
            info: "Продумання стрільби головного героя, механіка наведення прицілу на курсор, продумання пересування камери, продумання інвентаря, продумання модифікацій зброї, продумання додавання головному герою спеціальних здібностей, продумання механіки лікування головного геройя, додання одному з ворогів щита який витримує декілька попадань, продумання доброзичлового штучного інтелекту, продумання магазину, продумання локації в вигляді каналізації, продумання механіки закінчення гри та анімації, продумання босса штучногоінтелекту.",
            imgUrl: "./assets/Logo.jpg"
        },
        {
            id: 21,
            name: "Розробка ігрових механік",
            date: new Date("2021-11-21"),
            info: "Початок розробки розробки придуманих механік та пошуків методу їх забезпечення.",
            imgUrl: "./assets/Logo.jpg"
        },
        {
            id: 22,
            name: "Відмова від деякої кількості ігрових механік в зв'язку браку досвіду та спеціальних навичок або з непотрібності",
            date: new Date("2021-12-14"),
            info: "відмова від: модифікації зброї, додання головному герою спеціальх здібностей (окрім перекату), відмова від аніма лікування головного героя, відмова від босу штучного інтелекту, відмова від магазину та доброзичлового штучного інтелекту, відмова від додаткової локації у вигляді каналізації та відмова від анімації закінчення гри у вигляді прильоту гвинтокрила чи рятувальної машини.",
            imgUrl: "./assets/Logo.jpg"
        },
        {
            id: 23,
            name: "Набуття навичок по розробці навколишнього серидовища",
            date: new Date("2021-12-15"),
            info: "Перегляд з створення простих текстур та елементів навколишнього середовища.",
            imgUrl: "./assets/Logo.jpg"
        },
        {
            id: 24,
            name: "Розробка навколишнього серидовища та спрайтів",
            date: new Date("2021-12-15"),
            info: "Розробка та пошук текстур для навколишнього середовища гри.",
            imgUrl: "./assets/Logo.jpg"
        },
        {
            id: 25,
            name: "Вдосконалення серидовища, спрайтів, анімацій та коду",
            date: new Date("2022-01-03"),
            info: "Оптимізація спрайтів, переробка їх центрування, переробка та вдосконалення анімацій, створення більше текстур навколишньогосередовища гри.",
            imgUrl: "./assets/Logo.jpg"
        },
        {
            id: 26,
            name: "Робота над гарфічним інтерфейсом гри",
            date: new Date("2022-02-05"),
            info: "Розробка HP-bar, інтерфейс обраної зброї, відображення аптечок для відновлення HP-bar, відображення кількості набоїв для зброї.",
            imgUrl: "./assets/Logo.jpg"
        },
        {
            id: 27,
            name: "Розробка головного меню",
            date: new Date("2022-03-14"),
            info: "Розробка кнопок та іх анімаїй, розробка заднього фону головного меню, розробка паузи під час натискання ESC та вихід до голвного меню.",
            imgUrl: "./assets/Logo.jpg"
        },
        {
            id: 28,
            name: "Розробка глобального та локального освітелння",
            date: new Date("2022-03-17"),
            info: "Нбуття навичок з онлайн уроків та застосування їх з ствоернням глоального та локального освітлення, застосування різних методів його забезпечення.",
            imgUrl: "./assets/Logo.jpg"
        },
        {
            id: 29,
            name: "Тестування та дороблення гри",
            date: new Date("2022-04-19"),
            info: "Тест основних механік, штучного інтелекту, пересування, карти. Дороблення крти, освітелння, коду або перепис окремих методів.",
            imgUrl: "./assets/Logo.jpg"
        },
        {
            id: 30,
            name: "Здача проекту",
            date: new Date("2022-05-12"),
            info: "Оформлення та здача проекту.",
            imgUrl: "./assets/Logo.jpg"
        }
    ];
}