export default function blogPosts() {
    return [
        {
            id: 1,
            name: "Створення компанії",
            date: new Date("2017-03-17"),
            info: "Створення компанії для розробки комп'ютерних ігор.",
            imgUrl: ""
        },
        {
            id: 2,
            name: "Набір розробників",
            date: new Date("2020-12-10"),
            info: "Набір в команду: В нас з'явився головний розробник та головний дизайнер.",
            imgUrl: ""
        },
        {
            id: 3,
            name: "Початок роботи",
            date: new Date("2022-02-25"),
            info: "Початок роботи. ",
            imgUrl: ""
        },
        {
            id: 4,
            name: "Перший проект",
            date: new Date("2010-09-27"),
            info: "В пошуках ідей для першого проекту для нашої компанії.",
            imgUrl: ""
        },
        {
            id: 5,
            name: "Концепція нового проекту/гри",
            date: new Date("2010-01-29"),
            info: "Концепція гри брала натхнення з гри серії Tom Clancy's the Division. Також концепти вигляду гри брались з фантазії головного дизайнера.",
            imgUrl: ""
        },
        {
            id: 6,
            name: "Вибір жанру та стилів",
            date: new Date("2015-05-18"),
            info: "Перший проект позоціонує себе як 2D гра в жанрі шутер, в стилі top-duwn. Буде розроблятись на ігровому рушії Unity.",
            imgUrl: "",
        },
        {
            id: 7,
            name: "Ознайомлення з Unity",
            date: new Date("2023-02-10"),
            info: "Оскільки в нас немає досіду з роботою в Unity - ми почали дивитись курси та уроки по ньому щоб зрозуміти з чим ми маємо справу.",
            imgUrl: ""
        },
        {
            id: 8,
            name: "Набуття нових вмінь в Visual Studio на C#",
            date: new Date("2020-01-18"),
            info: "Вивчення нових систем та бібліотек, нових фішок, та поеднання розробки з Unity.",
            imgUrl: ""
        },
        {
            id: 9,
            name: "Тест набутих навичок в Unity",
            date: new Date("2013-10-25"),
            info: "Проведення простих тестів",
            imgUrl: ""
        },
        {
            id: 10,
            name: "Створення простого коду гри",
            date: new Date("2015-01-26"),
            info: "",
            imgUrl: ""
        },
        {
            id: 11,
            name: "Набуття навичок для створення графічних елемнів гри",
            date: new Date("2011-11-11"),
            info: "",
            imgUrl: ""
        },
        {
            id: 12,
            name: "Створення перших спрайтів головного героя",
            date: new Date("2017-09-14"),
            info: "",
            imgUrl: ""
        },
        {
            id: 13,
            name: "Робота з першою анімацією",
            date: new Date("2015-10-27"),
            info: "",
            imgUrl: ""
        },
        {
            id: 14,
            name: "Вдосконалення спрайтів",
            date: new Date("2015-11-10"),
            info: "",
            imgUrl: ""
        },
        {
            id: 15,
            name: "Переробка коду",
            date: new Date("2018-03-27"),
            info: "",
            imgUrl: ""
        },
        {
            id: 16,
            name: "Створення спрайтів ворогів",
            date: new Date("2012-02-10"),
            info: "",
            imgUrl: ""
        },
        {
            id: 17,
            name: "Набуття навичок з розробки штучного інтелекту для Unity на C#",
            date: new Date("2022-08-12"),
            info: "",
            imgUrl: ""
        },
        {
            id: 18,
            name: "Розробка коду першого штучного інтелекту",
            date: new Date("2014-10-08"),
            info: "",
            imgUrl: ""
        },
        {
            id: 19,
            name: "Набуття навичок з оформелнням старту гри",
            date: new Date("2022-09-08"),
            info: "",
            imgUrl: ""
        },
        {
            id: 20,
            name: "Вибір ігрових механік",
            date: new Date("2022-05-05"),
            info: "",
            imgUrl: ""
        },
        {
            id: 21,
            name: "Розробка ігрових механік",
            date: new Date("2019-03-08"),
            info: "",
            imgUrl: ""
        },
        {
            id: 22,
            name: "Відмова від декількох ігрових механік в зв'язку браку досвіду та спеціальних навичок або з непотрібності",
            date: new Date("2011-11-08"),
            info: "",
            imgUrl: ""
        },
        {
            id: 23,
            name: "Набуття навичок по розробці навколишнього серидовища",
            date: new Date("2012-10-12"),
            info: "",
            imgUrl: ""
        }
        {
            id: 24,
            name: "Розробка навколишнього серидовища та спрайтів",
            date: new Date("2012-10-12"),
            info: "",
            imgUrl: ""
        }
        {
            id: 25,
            name: "Вдосконалення серидовища, спрайтів, анімацій та коду",
            date: new Date("2012-10-12"),
            info: "",
            imgUrl: ""
        }
        {
            id: 26,
            name: "Робота над гарфічним інтерфейсом гри",
            date: new Date("2012-10-12"),
            info: "",
            imgUrl: ""
        }
        {
            id: 27,
            name: "Розробка головного меню",
            date: new Date("2012-10-12"),
            info: "",
            imgUrl: ""
        }
        {
            id: 28,
            name: "Розробка глобального та локального освітелння",
            date: new Date("2012-10-12"),
            info: "",
            imgUrl: ""
        }
        {
            id: 29,
            name: "Тестування та дороблення гри",
            date: new Date("2012-10-12"),
            info: "",
            imgUrl: ""
        }
        {
            id: 30,
            name: "Здача проекту",
            date: new Date("2012-10-12"),
            info: "",
            imgUrl: ""
        }
    ];
}